zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_MC_ME.h
#define MC_ME_PRTN1_COFB0_CLKEN_REQ13_MASK       (0x2000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ13_SHIFT      (13U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ13_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ13(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ13_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ13_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ14_MASK       (0x4000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ14_SHIFT      (14U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ14_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ14(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ14_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ14_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ15_MASK       (0x8000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ15_SHIFT      (15U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ15_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ15(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ15_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ15_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ21_MASK       (0x200000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ21_SHIFT      (21U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ21_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ21(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ21_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ21_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ22_MASK       (0x400000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ22_SHIFT      (22U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ22_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ22(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ22_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ22_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ23_MASK       (0x800000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ23_SHIFT      (23U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ23_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ23(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ23_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ23_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ24_MASK       (0x1000000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ24_SHIFT      (24U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ24_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ24(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ24_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ24_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ28_MASK       (0x10000000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ28_SHIFT      (28U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ28_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ28(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ28_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ28_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ29_MASK       (0x20000000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ29_SHIFT      (29U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ29_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ29(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ29_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ29_MASK)

#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_MASK       (0x80000000U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_SHIFT      (31U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31_WIDTH      (1U)
#define MC_ME_PRTN1_COFB0_CLKEN_REQ31(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB0_CLKEN_REQ31_SHIFT)) & MC_ME_PRTN1_COFB0_CLKEN_REQ31_MASK)
/*! @} */

/*! @name PRTN1_COFB1_CLKEN - Partition 1 COFB Set 1 Clock Enable Register */
/*! @{ */

#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_MASK       (0x1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_SHIFT      (0U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ32(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ32_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ32_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_MASK       (0x2U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_SHIFT      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ33(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ33_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ33_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_MASK       (0x4U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_SHIFT      (2U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ34(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ34_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ34_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_MASK       (0x400U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_SHIFT      (10U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ42(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ42_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ42_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_MASK       (0x2000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_SHIFT      (13U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ45(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ45_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ45_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_MASK       (0x8000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_SHIFT      (15U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ47(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ47_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ47_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_MASK       (0x20000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_SHIFT      (17U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ49(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ49_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ49_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_MASK       (0x80000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_SHIFT      (19U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ51(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ51_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ51_MASK)

#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK       (0x200000U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT      (21U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53_WIDTH      (1U)
#define MC_ME_PRTN1_COFB1_CLKEN_REQ53(x)         (((uint32_t)(((uint32_t)(x)) << MC_ME_PRTN1_COFB1_CLKEN_REQ53_SHIFT)) & MC_ME_PRTN1_COFB1_CLKEN_REQ53_MASK)

